# Creating a MySQL Database from Movie Data

In [1]:
# Import Libraries 
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import database_exists, create_database

In [2]:
# read in dataframes from GitHub Data folder
title_basics = pd.read_csv('Data/title_basics.csv.gz')
title_ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz')

## Load and Explore Dataframes

### Title Basics

In [3]:
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81112 entries, 0 to 81111
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81112 non-null  object
 1   titleType       81112 non-null  object
 2   primaryTitle    81112 non-null  object
 3   originalTitle   81112 non-null  object
 4   isAdult         81112 non-null  int64
 5   startYear       81112 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81112 non-null  int64
 8   genres          81112 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.6+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [4]:
# for the title basics, we only need the tconst, primary title, start year,
# runtime, and genres. I will resave the df with only these columns
title_basics.drop(columns=['titleType','originalTitle','isAdult','endYear'],
                    inplace=True)
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81112 entries, 0 to 81111
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81112 non-null  object
 1   primaryTitle    81112 non-null  object
 2   startYear       81112 non-null  int64
 3   runtimeMinutes  81112 non-null  int64
 4   genres          81112 non-null  object
dtypes: int64(2), object(3)
memory usage: 3.1+ MB

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama
2,tt0069049,The Other Side of the Wind,2018,122,Drama
3,tt0088751,The Naked Monster,2005,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,Crime and Punishment,2002,126,Drama

### Title Ratings

In [5]:
title_ratings.info()
title_ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 491345 entries, 0 to 491344
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         491345 non-null  object
 1   averageRating  491345 non-null  float64
 2   numVotes       491345 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.2+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1959
1  tt0000002            5.8       263
2  tt0000005            6.2      2596
3  tt0000006            5.1       177
4  tt0000007            5.4       814

### TMDB API Results

In [6]:
tmdb_data.info()
tmdb_data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2529 entries, 0 to 2528
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2529 non-null   object
 1   adult                  2527 non-null   float64
 2   backdrop_path          1352 non-null   object
 3   belongs_to_collection  203 non-null    object
 4   budget                 2527 non-null   float64
 5   genres                 2527 non-null   object
 6   homepage               169 non-null    object
 7   id                     2527 non-null   float64
 8   original_language      2527 non-null   object
 9   original_title         2527 non-null   object
 10  overview               2476 non-null   object
 11  popularity             2527 non-null   float64
 12  poster_path            2268 non-null   object
 13  production_companies   2527 non-null   object
 14  production_countries   2527 non-null   object
 15  release_date           2512 non-null   object
 16  revenue                2527 non-null   float64
 17  runtime                2527 non-null   float64
 18  spoken_languages       2527 non-null   object
 19  status                 2527 non-null   object
 20  tagline                1082 non-null   object
 21  title                  2527 non-null   object
 22  video                  2527 non-null   float64
 23  vote_average           2527 non-null   float64
 24  vote_count             2527 non-null   float64
 25  certification          807 non-null    object
dtypes: float64(9), object(17)
memory usage: 513.8+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.100,8.0,NaN
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,4.000,1.0,NaN
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.112,2135.0,PG

In [7]:
# for the api_df we only need the movie id, revenue, budget, and certification
# I will save the df only keeping these 4 columns
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data.info()
tmdb_data.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2529 entries, 0 to 2528
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2529 non-null   object
 1   revenue        2527 non-null   float64
 2   budget         2527 non-null   float64
 3   certification  807 non-null    object
dtypes: float64(2), object(2)
memory usage: 79.2+ KB

     imdb_id     revenue      budget certification
0          0         NaN         NaN           NaN
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG

I will delete all rows in which the imdb_id == 0, since these are not actual movie data.

In [8]:
tmdb_data = tmdb_data[tmdb_data['imdb_id'] != '0']
tmdb_data.head()

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG
5  tt0118852         0.0         0.0             R

## Normalize Title Basics Table

### Normalize genres

Convert single string of genres from the title basics dataframe into two new tables: title_genres and genres

In [9]:
# create new column with a list of all unique genres for each title
# using the split function
title_basics['genres_split'] = title_basics['genres'].str.split(',')
title_basics.head(2)

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,Drama,[Drama]

In [10]:
# use .explode() to separate list of genres into new rows
exploded_genres = title_basics.explode('genres_split')

# get string column converted to a list of strings in each row
genres_split = title_basics['genres'].str.split(',')
# explode the series and take unique entries only
unique_genres = genres_split.explode().unique()
# sort unique genres
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [11]:
# create new title_genres table
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [12]:
# create genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [13]:
# replace genres in title_genres with new integer id
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres.drop(columns='genres_split', inplace=True)

In [14]:
# convert genre map dictionary to dataframe
genres = pd.DataFrame({'Genre_Name':genre_map.keys(),
                      'Genre_ID':genre_map.values()})
genres.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Discard unnecessary information

In [15]:
# drop genres and genres_split column from title_basics dataframe
title_basics.drop(columns=['genres','genres_split'], inplace=True)
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

## Saving MySQL Tables

### Create MySQL Server

In [16]:
# Server information
username = "dcbailo89"
password = "1qaz2wsx3edc4rfv"
db_name = "movies"
host_name = "192.168.1.6"
connection = f"mysql+pymysql://{username}:{password}@{host_name}/{db_name}"

In [17]:
engine = create_engine(connection)
if not database_exists(engine.url):
    create_database(engine.url)
print(database_exists(engine.url))
engine

True

Engine(mysql+pymysql://dcbailo89:***@192.168.1.6/movies)

ABOVE CODE TO CREATE A NEW ENGINE FOUND ON STACK OVERFLOW: https://stackoverflow.com/questions/6506578/how-to-create-a-new-database-using-sqlalchemy

### title_basics Table

In [18]:
# view title_basics dataframe
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81112 entries, 0 to 81111
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81112 non-null  object
 1   primaryTitle    81112 non-null  object
 2   startYear       81112 non-null  int64
 3   runtimeMinutes  81112 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.5+ MB

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [19]:
# calculate max string lengths for object columns
key_len = title_basics['tconst'].fillna('').map(len).max()
title_len = title_basics['primaryTitle'].fillna('').map(len).max()
# create schema dictionary using SQLAlchemy datatype objects
title_basics_schema = {
    "tconst":String(key_len+1),
    "primaryTitle":Text(title_len+1),
    "startYear":Integer(),
    "runtimeMinutes":Integer()}

In [20]:
# add table to MySQL Server
title_basics.to_sql('title_basics',engine,dtype=title_basics_schema,
                   if_exists='replace',index=False)

81112

In [21]:
# add primary key to title_basics table
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [22]:
# execute query to display first 5 rows of table
q = """
SELECT * FROM title_basics
LIMIT 5;
"""
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

### title_ratings Table

In [23]:
# view title_ratings dataframe
title_ratings.info()
title_ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 491345 entries, 0 to 491344
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         491345 non-null  object
 1   averageRating  491345 non-null  float64
 2   numVotes       491345 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.2+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1959
1  tt0000002            5.8       263
2  tt0000005            6.2      2596
3  tt0000006            5.1       177
4  tt0000007            5.4       814

In [24]:
# calculate max string lengths for object columns
key_len = title_ratings['tconst'].fillna('').map(len).max()
# create schema dictionary using SQLAlchemy datatype objects
title_ratings_schema = {
    "tconst":String(key_len+1),
    "averageRating":Float(),
    "numVotes":Integer()}

In [25]:
# add table to MySQL Server
title_ratings.to_sql('title_ratings',engine,dtype=title_ratings_schema,
                   if_exists='replace',index=False)

491345

In [26]:
# add primary key to title_basics table
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [27]:
# execute query to display first 5 rows of table
q = """
SELECT * FROM title_ratings
LIMIT 5;
"""
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1959
1  tt0000002            5.8       263
2  tt0000005            6.2      2596
3  tt0000006            5.1       177
4  tt0000007            5.4       814

### title_genres Table

In [28]:
# view title_genres dataframe
title_genres.info()
title_genres.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 151955 entries, 0 to 81111
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    151955 non-null  object
 1   genre_id  151955 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [29]:
# calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
# create schema dictionary using SQLAlchemy datatype objects
title_genres_schema = {
    "tconst":String(key_len+1),
    "genre_id":Integer()}

In [30]:
# add table to MySQL Server
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,
                   if_exists='replace',index=False)

151955

In [31]:
# execute query to display first 5 rows of table
q = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(q,engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### genres Table

In [32]:
# view genres dataframe
genres.info()
genres.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Genre_Name  26 non-null     object
 1   Genre_ID    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [33]:
# calculate max string lengths for object columns
name_len = genres['Genre_Name'].fillna('').map(len).max()
# create schema dictionary using SQLAlchemy datatype objects
genres_schema = {
    "Genre_Name":String(name_len+1),
    "Genre_ID":Integer()}

In [34]:
# add table to MySQL Server
genres.to_sql('genres',engine,dtype=genres_schema,
                   if_exists='replace',index=False)

26

In [35]:
# add primary key to title_basics table
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [36]:
# execute query to display first 5 rows of table
q = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(q,engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### tmdb_data Table

In [37]:
# view tmdb_data dataframe
tmdb_data.info()
tmdb_data.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2527 entries, 1 to 2528
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2527 non-null   object
 1   revenue        2527 non-null   float64
 2   budget         2527 non-null   float64
 3   certification  807 non-null    object
dtypes: float64(2), object(2)
memory usage: 98.7+ KB

     imdb_id     revenue      budget certification
1  tt0113026         0.0  10000000.0           NaN
2  tt0113092         0.0         0.0           NaN
3  tt0116391         0.0         0.0           NaN
4  tt0118694  12854953.0    150000.0            PG
5  tt0118852         0.0         0.0             R

In [38]:
# calculate max string lengths for object columns
id_len = tmdb_data['imdb_id'].fillna('').map(len).max()
cert_len = tmdb_data['certification'].fillna('').map(len).max()
# create schema dictionary using SQLAlchemy datatype objects
tmdb_schema = {
    "imdb_id":String(id_len+1),
    "revenue":Float(),
    "budget":Float(),
    "numVotes":Text(cert_len+1)}

In [39]:
# add table to MySQL Server
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_schema,
                   if_exists='replace',index=False)

2527

In [40]:
# add primary key to title_basics table
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [41]:
# execute query to display first 5 rows of table
q = """
SELECT * FROM tmdb_data
LIMIT 5;
"""
pd.read_sql(q,engine)

     imdb_id     revenue      budget certification
0  tt0035423  76019000.0  48000000.0         PG-13
1  tt0113026         0.0  10000000.0          None
2  tt0113092         0.0         0.0          None
3  tt0114447         0.0         0.0          None
4  tt0116391         0.0         0.0          None

## Check Tables in the New MySQL Server

In [42]:
# execute query to display tables in the movies server
q = """
SHOW TABLES;
"""
pd.read_sql(q,engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data